{
    "page_title": "Climb Mount Kilimanjaro",
    "page_sub_title": "Everything you should know to be successful.",
    "page_slug": "climb-mount-kilimanjaro",
    "short_description": "This page will guide you how to climb Kilimanjaro. It begins with picking the best time, traveling to Tanzania, then to the mountain Kilimanjaro.",
    "description": "<p>You can read about the total cost, choosing a trekking agency, picking a route, and also I discuss all the things during the trek itself: training, fitness, altitude sickness many others..<strong>.</strong></p>\n\n<p>Everything that I mention above is explained in detail on another page, but here you can get the best overview of what it takes to climb Mount Kilimanjaro.</p>\n\n<p><br />\n<strong>Mount Kilimanjaro is located in northern Tanzania in East Africa</strong>!Close to the border to Kenya.</p>\n\n<p>(Map of Tanzania&nbsp;|&nbsp;Map of Kilimanjaro area)</p>\n\n<p>With official&nbsp;<a href=\"https://www.mountkilimanjarohike.com/kilimanjaro-routes\">height</a>&nbsp;of 5895 meters or 19340 feet. Mt. Kilimanjaro is the highest mountain in Africa and also the highest free standing mountain in the world!<br />\nIt&rsquo;s standing there all by itself in a plain; it&rsquo;s not in a mountain range.</p>\n\n<p>To climb Mt. Kilimanjaro you have to plan and prepare.</p>\n\n<p><strong>&nbsp; &nbsp; </strong></p>\n\n<h3><strong>&nbsp;Planning and preparation are Important to the success of a Kilimanjaro climb!</strong></h3>\n\n<p>Note when I say success i do not only mean your chances to reach the summit but how much you will enjoy the whole trek from the start to the end.</p>\n\n<p>Planning the Kilimanjaro Climb</p>\n\n<p>You have to make&nbsp;<strong>three major decisions before you can climb Kilimanjaro</strong>:</p>\n\n<ul>\n\t<li>You should decide on a date.</li>\n\t<li>You should decide on the climb route and days.</li>\n\t<li>You should decide on a trekking agency/climb operator.</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<ol>\n\t<li>\n\t<p>Deciding on a Kilimanjaro date</p>\n\t</li>\n</ol>\n\n<p>The best times to climb Mt. Kilimanjaro are during the driest months of the year, which are Jan/Feb and Aug/Sep.<br />\nAlthough any time from January and mid-March or June and October offers reasonable chances of good&nbsp;weather on Kilimanjaro.</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp; &nbsp; &nbsp; &nbsp;2. Select a climb route and the duration of your Kilimanjaro climb</p>\n\n<p>There are many&nbsp;climb routes up Kilimanjaro. They differ in length and difficulty. All routes except one require you to camp.</p>\n\n<p>The&nbsp;Marangu route&nbsp; offers you&nbsp; hut accommodation and camping is not allowed.<br />\nFive days is the bear&nbsp;<strong>minimum duration for a Kilimanjaro trek</strong>, six is better. For the popular&nbsp;Machame route&nbsp;six days is the bear minimum, seven days is the best.</p>\n\n<p>Having an extra day for&nbsp;acclimatization&nbsp;will highly improve your chances to reach the summit.There are longer treks available but are more expensive.</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp; &nbsp; &nbsp; &nbsp;3. Deciding on your trekking agency or climb operator</p>\n\n<p>Mount Kilimanjaro under the Kilimanjaro National Park. Access is restricted and the steep&nbsp;Kilimanjaro park fees&nbsp;make a Kilimanjaro climb more expensive.</p>\n\n<p>But before you go to find a cheap Kilimanjaro climb, Please read about the true&nbsp;cost of climbing Kilimanjaro.</p>\n\n<p><strong>You can only climb Kilimanjaro with a registered guide or trekking agency.</strong></p>\n\n<p>A good climb operator will supply&nbsp;guides, a cook,&nbsp;porters, food, water, and camping equipment.</p>\n\n<p>There is no need, well no opportunity, for you to stress about the details. You won&rsquo;t need to carry anything but your day pack.</p>\n\n<p>You will not cook or put up your tent or anything. You just need to select your&nbsp;Kilimanjaro tour operator.</p>\n\n<p>Most people book their Mount Kilimanjaro climb from abroad. This is very recommended than selecting a climb operator in the last minute when you get to Tanzania.</p>\n\n<p><strong>The options of&nbsp;Mt. Kilimanjaro tours&nbsp;to choose from is overwhelming.</strong></p>\n\n<p>The quality varies wildly, from irresponsible &ldquo;cowboy&rdquo; outfits to luxury climb operators who just about carry you to the top of Kilimanjaro.</p>\n\n<p>What you should be searching for is a quality and responsible operator who first treats their staff well.</p>\n\n<p>Do NOT pinch prices on Kilimanjaro and do not climb Kilimanjaro with a lower end budget operator.</p>\n\n<p>asking me of the best operator I personally recommend. There is. You can&nbsp;contact the best operator through this page.)</p>\n\n<h3>How to Prepare for you Kilimanjaro Experience</h3>\n\n<p><strong>You should do some preparation before you can climb Kilimanjaro:</strong></p>\n\n<ul>\n\t<li>You should book your flights.</li>\n\t<li>You should organize your visa.</li>\n\t<li>You should get the required vaccinations.</li>\n\t<li>You should buy or rent the necessary equipment.</li>\n\t<li>You should get yourself into shape.</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p>&nbsp; &nbsp; &nbsp; &nbsp; 4.Booking your flights</p>\n\n<p>When you book your Kilimanjaro trek from abroad then your trekking agency may also organize your&nbsp;Kilimanjaro flight&nbsp;for you. If its not the case the you should book on your own.</p>\n\n<p>The closest airport to Mt. Kilimanjaro is, known as&nbsp;<strong>Kilimanjaro Airport (JRO)</strong>. Kilimanjaro Airport is positioned half way between Arusha and Moshi, you should land their.</p>\n\n<p>Mt. Kilimanjaro is near to Moshi. Many trekking agencies are located in Moshi, though you also find a good number in Arusha.</p>\n\n<p>Arusha is also the &ldquo;safari capital&rdquo; of Tanzania and the gateway to Ngorongoro, Serengeti, Tarangire etc. Serengeti Safari</p>\n\n<p>If you are planning for Tanzania trip you may use other main airports in the area: Dar es Salaam, Zanzibar and Nairobi.</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp; &nbsp; &nbsp; &nbsp;5. Organizing your Tanzania visa</p>\n\n<p>You need a visa to enter Tanzania and a passport that&rsquo;s valid for at least another 6 months ahead.</p>\n\n<p>If in your country the is no Tanzanian embassy, go through their website to find out how to obtain your visa.</p>\n\n<p>The easiest way is for to buy a visa upon arrival in Tanzania. It Cost 50 usd to all countries except USA its 100 usd.</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp; &nbsp; &nbsp; 6. Getting right vaccinations</p>\n\n<p>You should have a yellow fever certificate and a number of other&nbsp;vaccinations recommended. Some of them need to begin months in advance, so talk to your doctor soon.</p>\n\n<p>According to your travel plans you may also want to take anti-malaria medication. Contact your doctor.</p>\n\n<p>What exactly you need mostly depends on the length of your stay and other places you will visit besides Kilimanjaro, e.g. Zanzibar and safari.</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp; &nbsp; &nbsp; &nbsp;7. Organizing the all necessary equipment</p>\n\n<p>If you booked with a good operator then quality camping equipment are included in the total price.</p>\n\n<p>Many Kilimanjaro tour operators have gear for rent, gear that you may not want to purchase for one time use only or have it in an extended trip in Tanzania.<br />\nEquipment for rent includes: down sleeping bags, insulation pads and down jackets.</p>\n\n<p>Also you will need very good quality, thermal under and upper layers of clothing, gloves, warm hat, good sunglasses, sunscreen (for the lips, too!), a day pack, rain protection for everything, water bottles/camel back and more.</p>\n\n<p>Most importantly high quality hiking boots and they need to fit you well!<br />\nA list of&nbsp;essential Kilimanjaro equipment&nbsp;and the&nbsp;packing tips for Kilimanjaro.</p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp; &nbsp; &nbsp; &nbsp;8. Getting yourself into shape</p>\n\n<p>Mt. Kilimanjaro is a very popular climb because,&nbsp;<strong>Kili requires no special expertise or mountaineering equipment.</strong>&nbsp;In fact, it is not a climb, it&rsquo;s a hike.<br />\nYou can walk all the way to the top!</p>\n\n<p>That sounds easy but isn&rsquo;t!</p>\n\n<p>Read on&nbsp;training for Kilimanjaro&nbsp;and&nbsp;beating altitude sickness on Kilimanjaro. The more training you do in the time leading up to your Kilimanjaro climb, the better.<br />\nKilimanjaro does not require special mountaineering experience, but&nbsp;long distance trekking and hiking experience sure helps!</p>\n\n<p>It also helps if you have experience to camping out and roughing it, because you will certainly have to rough it when you climb Kilimanjaro.</p>\n\n<p><strong>Only 50% of the people who climb Kilimanjaro make it to the Peak.</strong></p>\n\n<p>Don&rsquo;t let that put you off! Our operators have client success rates of 80% to 90%, and they aren&rsquo;t lying.</p>\n\n<p>Ok, some may exaggerate a bit the number, but with the right preparation it is possible to tackle Kili with a higher than 90% success chance to summit.</p>\n\n<p>In nearly all cases of failed summit attempts the main reason for failure is altitude sickness. See (beating altitude sickness on Kilimanjaro<u>)</u>.</p>\n\n<p><strong>Reaching the summit of Mt. Kilimanjaro is not a matter of luck, not of age, not of previous fitness or experience.</strong></p>\n\n<p>It&rsquo;s entirely up to you,You need to be willing to research and invest the time and money it takes.</p>\n\n<p><em>Anybody can climb Kilimanjaro!</em></p>\n\n<p>&nbsp;</p>\n\n<p>&nbsp;</p>\n\n<h3><strong>18 Interesting Facts About Mount Kilimanjaro</strong></h3>\n\n<ol>\n\t<li>\n\t<p><strong>Highest Mountain in Africa!</strong></p>\n\t</li>\n</ol>\n\n<p>Mount Kilimanjaro is the tallest mountain in Africa! And among one of the seven summits. Hikers do considered to be the easiest of the seven summits.</p>\n\n<p><strong>&nbsp;2.&nbsp;</strong><strong>Its just a simple walk all the way Up!</strong></p>\n\n<p>Trekking the mountain requires no technical skills! or equipment, such as rope, harness, crampons and ice axe. It is a hiking peak, not mountaineering.</p>\n\n<p><strong>3. The Highest Freestanding Mountain in the World</strong></p>\n\n<p>Kilimanjaro a part from being Africa&rsquo;s tallest peak, but its also the world&rsquo;s tallest free standing mountain. The summit, named Uhuru Point; is 5,895 meters (19,341 feet) above sea level.<br />\nMost high mountains are part of mountain ranges, such as Mount Everest&rsquo;s Himalayan Mountain Range, free standing mountains like Kilimanjaro are commonly a result of volcanic activity.</p>\n\n<p><strong>4. Ice at the Equator</strong></p>\n\n<p>Kilimanjaro lies only 205 miles from the equator, in the country of Tanzania. The equator is a imaginary line which divides the Northern and Southern Hemisphere.<br />\nWhen first explorers reported seeing glaciers on the top of Kilimanjaro, people &nbsp;thought it was impossible for ice to form so close to the hot, equatorial sun so they did not believe.</p>\n\n<p><strong>5. Not 1 peak but 3 peaks.</strong></p>\n\n<p>Kilimanjaro first had three volcanic cones (peak) &ndash; Kibo, Shira and Mawenzi. Kibo is the tallest cone and where the uhuru summit lies. Shira has since collapsed, creating the Shira Plateau on the western side of the mountain.<br />\nMawenzi is a rocky peak standing 5,149 meters or 16,896 feet tall, and is the third highest peak in Africa, after Kibo and Mount Kenya.</p>\n\n<p><strong>6. Last Eruption 360,000 years ago</strong></p>\n\n<p>Shira and Mawenzi are extinct volcanoes cones. However, Kibo is a dormant volcano cone; it can erupt again. The last major eruption was 360,000 years ago.<br />\nThe ash pit is a 2 hour round trip hike from the highest campsite, Crater Camp. If you visit the ash pit will you find the smell of sulfur from the volcano&rsquo;s lava.</p>\n\n<p><strong>7. Origin of the name Kilimanjaro</strong></p>\n\n<p>The origin of the name Kilimanjaro comes from the Swahili word &ldquo;Kilima&rdquo; (mountain) and the Chagga word &ldquo;Njaro&rdquo; (whiteness). Another say that Kilimanjaro is the European pronunciation of a KiChagga slogan meaning &ldquo;we failed to climb it.&rdquo;</p>\n\n<p><strong>8. First hike in 1889.</strong></p>\n\n<p>Mount Kilimanjaro was first hiked in 1889 by a Hans Meyer, an Austrian climber Ludwig Purtscheller and a local guide Yohani Kinyala Lauwo.&nbsp; On his first attempt in 1887 and second 1888, he made it to the base of Kibo since he did not have equipment for heavy snow and ice.</p>\n\n<p><strong>9. 50% fail to summit.</strong></p>\n\n<p>Now nearly 30,000 people climb Kilimanjaro every year. Unluckily about 50% of climbers fail, mostly due to altitude sickness. Most who fail picked to climb on the Marangu Route, which is the shortest path (five days round trip) to the peak. Nevertheless, the best way to climb is to use a longer route to help in acclimatization.</p>\n\n<p><strong>10. Someone ran up and down Kilimanjaro in less than 7 hours.</strong></p>\n\n<p>The fastest up and down at Kilimanjaro was done by Swiss Karl Egloff in just 6 hours and 42 minutes in 2014. Athletes in speed climbs of high altitude mountains have already acclimatized to the altitude before attempt. The recognized Kilimanjaro routes range from five to nine days on the mountain.</p>\n\n<p><strong>11. Oldest Ascent? Age 88.</strong></p>\n\n<p>The oldest person to successfully climb Kilimanjaro is 88 year old Dr. Fred Distelhorst, who broke the world record in 2017. Before oldest woman to climb Kilimanjaro is 86 year in 2015.</p>\n\n<p>12.The youngest age for climbing Kilimanjaro is 10 years,</p>\n\n<p>However the park authority grants permission to children who have significant experience trekking.</p>\n\n<p><strong>13. Youngest Ascent? Age 7.</strong></p>\n\n<p>The youngest person to climb Kilimanjaro is Coaltan Tanner American, who summited at age six in 2018.</p>\n\n<p><strong>14. Five Unique Ecosystems on the Mountain.</strong></p>\n\n<p>While climbing Kilimanjaro, You will experience five distinct ecological zones on their way to the peak. The cultivated land, rainforest, heather and moorlands, alpine desert, arctic summit. Each zone, gets colder and drier as the height increases.<br />\nPlant and animal life also fade. The summit is in the arctic zone, which is characterized by ice and rock. At this altitude, categorized as &ldquo;extreme&rdquo;, there can be no permanent human habitation.</p>\n\n<p><strong>15. Its glaciers are 10,000 years old, and they could be gone by 2030</strong></p>\n\n<p>Kilimanjaro&rsquo;s glaciers have shrunk 82% since 1912. Scientists assessed the glaciers may be completely gone in 50 years.<br />\nThe cause of this is thought to be due to deforestation, and not necessary global warming.<br />\nOver 5 million indigenous trees were planted around the base of the mountain in 2008 to fight the issue.</p>\n\n<p><strong>&nbsp;16.&nbsp;</strong><strong>Kilimanjaro&rsquo;s Peak is Actually Named Freedom</strong></p>\n\n<p>The mountain&rsquo;s highest point is Uhuru Peak, Swahili for freedom.</p>\n\n<p><strong>17. Africa&rsquo;s Tallest Indigenous Tree lives on Kilimanjaro</strong></p>\n\n<p>At 81 meters (265 feet), the tree (entandrophragma excelsum) was recently discovered on Kili&rsquo;s slopes. It&rsquo;s the sixth tallest tree on Earth and is 500-600 years old. This exceptional growth is due to Kilimanjaro&rsquo;s incredible, nutrient-rich volcanic soil and precipitation.</p>\n\n<p><strong>18. Coffee Surrounds Kilimanjaro</strong></p>\n\n<p>Tanzanian coffee is said by many to be the world&rsquo;s best, and most of the beans are grown in the volcanic soils and higher elevations of Kilimanjaro&rsquo;s foothills. Before your climb you will drive past endless fields of these coffee plantations, a significant part of the Tanzanian economy. Be sure and grab a bag!</p>\n\n<ol>\n\t<li>\n\t<p><strong>Many restricted people have also climbed Kilimanjaro.</strong></p>\n\t</li>\n</ol>\n\n<p>The most impressive is possibly Kyle Maynard who crawled to the summit of Kilimanjaro in 2012. And he was born with a genetic disease that resulted in him having no arms below the elbow or legs below the knee.</p>\n\n<ol>\n\t<li>The maximum base jump off Kilimanjaro was achieved by Russian, Valery Rozov, in February 2015</li>\n\t<li>The uppermost cricket match in the World was played in Kilimanjaro&rsquo;s crater in September 2014</li>\n\t<li>The number of climbers has hit golf shots off the summit and into the crater.</li>\n\t<li>A highest Pizza delivery was noted by Pizza Hut in May 2016</li>\n\t<li>The Tour de France team, Tinkoff-Saxo, mounted Kilimanjaro in October 2014</li>\n</ol>\n\n<ol>\n\t<li>Deaths on Kilimanjaro are not actively reported to the media, but some commentators estimate that between 3-7 people die on Kilimanjaro every year.</li>\n</ol>\n\n<p>That may sound like a lot but as far as big mountains go, the death rate is less then o.o1% of climbers.<br />\nMany hikers die from pre-existing diseases like heart circumstances or from altitude related issues like HACE and HAPE.</p>\n\n<p>26. Here are two rainy seasons on Kilimanjaro, April-May and November.</p>\n\n<p>The fullest season is June-September. December-March is not a bad time to climb, but the weather tends to be colder in the evenings and on the summit. Snow on the summit is more likely during this period.</p>\n\n<p>27.There are 7 official routes on Kilimanjaro.</p>\n\n<p>There are five routes use the Southern Circuit to the summit, via Stella Point.<br />\nThe&nbsp;Lemosho,&nbsp;Shira,&nbsp;Machame, Umbwe and&nbsp;Marangu Route.<br />\nAlso two other routes are&nbsp;Rongai&nbsp;and&nbsp;Northern Circuit&nbsp;, reach from the North-East and use Gilman&rsquo;s Point to the summit.</p>\n\n<h3><strong>IMPORTANT THINGS TO KNOW BEFORE TREKKING KILIMANJARO</strong></h3>\n\n<p><strong>1) &nbsp;&nbsp;&nbsp;Climbing is not as practical (or as difficult) as you think</strong></p>\n\n<p>Kilimanjaro Mountain is one of the Seven Summits, the tallest peak in Africa and the tallest free standing mountain in the world. &nbsp;The other six are typically very technical climbs that require a lot of training and preparation.</p>\n\n<p>So,&nbsp;<em>How Difficult is Climbing Mount Kilimanjaro</em>?&nbsp; Trekking Kilimanjaro does require a high level of physical endurance and strength. With some Training to Climb Mount Kilimanjaro, you will reach the highest summit in Africa.&nbsp;&nbsp;Climb Kilimanjaro Now.</p>\n\n<p><strong>2) &nbsp;&nbsp;&nbsp;Prepare to be Cold &amp; Wet</strong></p>\n\n<p>I decided to hike Kilimanjaro in May, which is between the low and high season and therefore there was a lot more rain than I ever expected.</p>\n\n<p>I came with both a rain jacket and rain pants but still felt wet all the time. The team that accompanies you on the climb (porters, guide, assistant guide, chef, etc.) is there to help you.</p>\n\n<p>Whether or not you think you need the extra help, you will rely on your team members with their mountain expertise and equipment including the tarps that they bring up the mountain to ensure that none of your bags get wet.</p>\n\n<p>Though Kilimanjaro is in Africa and is located on the Equator- when you climb close to 20,000 feet, it is cold no matter where you are.<br />\nWhen I climbed the mountain, I was not prepared for just how cold it would be.</p>\n\n<p>My double pair of socks, extra layer of thermals, fleece top and warm hat helped but I wished I had even more layers to keep me warm.</p>\n\n<p>It is<strong>&nbsp;vital</strong>&nbsp;to know the best times to climb Kilimanjaro (Jan &ndash; March and June &ndash; Oct)<strong>&nbsp;</strong>and&nbsp;<strong>pack the right gear for Kilimanjaro</strong>&nbsp;so that you can stay warm and dry when the rain &amp; cold comes.</p>\n\n<p><strong>3) &nbsp;&nbsp;&nbsp;Take the Right Gear &amp; Bring a Headlamp + Extra Batteries</strong></p>\n\n<p><strong>Packing the Right Gear for Kilimanjaro&nbsp;</strong>is needed when climbing (as well-known in the point above). When you are in camp you won&rsquo;t have any electricity, so it is important to prepare for low light situations.</p>\n\n<p>Whether you are camping or remaining in the huts, you&rsquo;re eating area and bathroom will both be a short walk from where you are sleeping.<br />\nWhen it is dark, this can be very difficult if you don&rsquo;t have a headlamp or other way to light up the path in front of you.</p>\n\n<p><strong>4) &nbsp;&nbsp;&nbsp;Tipping is Optional (yet expected)</strong></p>\n\n<p>Most countries tipping are considered nice, but not necessarily a common practice. &nbsp;When hiking Kilimanjaro, tipping is a bit different.<br />\nThe group that takes you up the mountain consists of a lead guide, assistant guide, chef, and a team of porters (anywhere from 5-10 depending on your group size).<br />\nYou&rsquo;re&nbsp;Kilimanjaro Guide&nbsp;&amp; Team plays a massive role in the success of your summit, making sure that you take the proper precautions in what you eat, when you sleep, and how much you climb each day.</p>\n\n<p>It is mutual for people to ask,&nbsp;<strong>how much do I tip my guide and Porters on Kilimanjaro?</strong><br />\nUsually, tips include $15-$20 per day for the head guide, &nbsp;$10-$15 per day for the assistant guide &amp; chef, and $5-$10 per day for each porter (a sum of roughly $100 per night you are on the mountain).</p>\n\n<p>At the end of your hike your team will gather together for a &ldquo;tipping ceremony&rdquo; where they will make local songs and dances, and provide you with envelopes (or something similar) to tip the team.</p>\n\n<p><strong>Tipping Guides and Porters on Kilimanjaro</strong></p>\n\n<p>Is important, as you are directly helping their families and local communities with your tip.<br />\n*It is important to note that this tip is per group and not per person.</p>\n\n<p><strong>5) &nbsp;&nbsp;Get ready for Huts/Tents, Sponge Baths, and Squat Toilets</strong></p>\n\n<p>Depending on what Kilimanjaro<strong>&nbsp;route you climb</strong>, you will be staying in either huts (on the Marangu route) or tents (on every other rout e).</p>\n\n<p>Every morning and evening of my climb I was greeted at the door of my hut (or tent) by one of the porters carrying a small bucket of warm water and a towel.</p>\n\n<p>&ldquo;Time for washy-washy!&rdquo; This nice gesture to provide me with a bath / shower each morning was importantly appreciated and I came to look forward to the warm water I could use to clean my face, arms, legs and any other part of my body that needed some TLC.</p>\n\n<p>Most of the mornings and evenings it was quite cold, so I resulted to washing just my face and hands.</p>\n\n<p><strong>6) &nbsp;&nbsp;&nbsp;Walk Slow &amp; Drink Lots of Water &ldquo;Pole Pole &ldquo;</strong></p>\n\n<p>This is the most common phrases you will hear on the mountain is &ldquo;Pole-Pole&rdquo;<br />\nIn the local language of Swahili this means &ldquo;slowly, slowly&rdquo;.</p>\n\n<p>When climbing 10 &ndash; 20 thousand feet, it is important to pace yourself. The slower you go, the more oxygen you will get in your body and the better you will acclimatize.<br />\nDrink plenty of water is very important for you to have a successful summit, I always had a full water bottle in my backpack, along with enough of healthy snacks to do my best in&nbsp;<strong>Preventing AMS (Altitude Mountain Sickness).</strong></p>\n\n<p><strong>7) &nbsp;&nbsp;&nbsp;Avoid AMS, Train &amp; Take Diamox before you climb</strong></p>\n\n<p>Diamox is a mutual medication for altitude sickness or &ldquo;mountain sickness&rdquo;.<br />\nWhile I am no doctor, I know that this medication greatly helped me during my climb.<br />\nThere are many&nbsp;<strong>ways to prevent altitude sickness while climbing Kilimanjaro</strong>&nbsp;and being prepared with Diamox was the best thing that I ever did.<br />\nI started taking Diamox a few days before I climbed and continued taking it throughout the duration of the climb until I came off the mountain.<br />\nThis helped me with the headaches, tiredness, and shortage of breath that so many other people experienced when we hit above 10,000 feet.<br />\nMake sure to consult your doctor before taking any medication on ways you can&nbsp;<strong>prevent altitude sickness while climbing Kilimanjaro</strong>.<br />\nWhile it was still a physical struggle, I summited the mountain without any signs of altitude sickness.</p>\n\n<p><strong>8) &nbsp;&nbsp;&nbsp;Take the Coca-Cola Route</strong></p>\n\n<p>There are 7 routes up mount Kilimanjaro, with the most popular Marangu Route, also known as the &ldquo;Coca-cola Route&rdquo;.<br />\nThe&nbsp;Marangu route&nbsp; only route has mountain huts, and allows you to climb the mountain in the shortest number of days.<br />\nIf you want little adventure, you can take the Machame Route, a longer camping climb that follows the rim of the volcano with outstanding views &ndash; or alternatively there are 5 additional camping routes that you can choose from (but none are scenic as the Machame Camping Route).<br />\nI made my decision to climb the&nbsp;Machame Route&nbsp;based on many factors, including the highest&nbsp;<strong>Success Rate of Kilimanjaro Routes</strong>.<br />\nIf you prepare well for the mountain, the mountain will welcome you, and you will make it to the summit.&nbsp; See our full itinerary for climbing&nbsp;Kilimanjaro&rsquo;s Marangu Route.</p>\n\n<p><strong>9) &nbsp;&nbsp;&nbsp;Remember Lion-King Days (Speak some Swahili)</strong></p>\n\n<p>The local language in Tanzania is Swahili. The same language that you might have learned when you were a child watching the Lion King. Learning to say some of the local Swahili language goes a long way in making friends with your climbing crew.<br />\nIt doesn&rsquo;t take much to learn, here are a few of the words that I found the most useful / fun while climbing the mountain!<br />\nSimba &ndash; Lion / King<br />\nRafiki &ndash; Friend<br />\nHakuna Matata &ndash; No Worries!<br />\nNala &ndash; gift<br />\nAsante Sana &ndash; Thank you!<br />\nJambo &ndash; Hello!<br />\nMambo &ndash; How are you!<br />\nPole Pole (pronounced &ldquo;pulley&rdquo;) &ndash; Slowly, slowly</p>\n\n<p><strong>10) Summit Day is Brutal &ndash; But its Worth It!</strong></p>\n\n<p>The first days climbing Kilimanjaro is long, but not difficult. The terrain varies constantly from straight flats to uphill climbs, and even some downhill.<br />\nAnother exceptional aspect of climbing Kilimanjaro is that you go through 5 diverse climatic Zones &ndash; Savannah &amp; Jungle, Alpine Forest, Heather &amp; Moorland, Highland Desert, and lastly &ndash; Arctic Tundra.<br />\nThe first three climatic zones are beautiful, scenic, and not as hard as the last two. When you reach the Highland Desert you are at 15,000 feet, and that is when the hike gets more difficult.<br />\nThe air is thinner, colder, and the terrain is steeper. On the last day of the climb your team will wake up around midnight to prepare to navigate up the side of the volcano, making it in time for sunrise at Gilman&rsquo;s peak (4-6 hour climb).<br />\nI remember taking my summit night one footstep at a time, and in between each step was a much needed gasp for air.<br />\nBefore I knew it I made it to both Gilman&rsquo;s and Uhuru&rsquo;s Peak (Uhuru is the highest peak on Kilimanjaro)!<br />\nHaving a successful experience &amp; summit on Kilimanjaro is very possible and comes down to three things: &nbsp;<strong>Training for Mount Kilimanjaro,&nbsp;</strong><strong>Packing the right Gear for Kilimanjaro</strong>, and trusting in your climbing crew.</p>\n\n<p><strong>Bonus:</strong></p>\n\n<p>Do a Safari after you complete your climb, as it is one of the great ways to rest and relax your muscles after an intense week of hiking.&nbsp; We recommend a&nbsp;Tanzania Safari&nbsp;to Serengeti National Park and Ngorongoro Crater.</p>\n\n<p><strong>11 Wear your boots in</strong></p>\n\n<p>It may seem clear, but it is surprising how many people don&rsquo;t do this. As a non-climber, I spent a good deal of time ahead of the trek finding the right boots after it was drummed into me that they really can make or break the trip.<br />\nPurchasing them signaled the start of the hard work, and I devotedly laced my boots up most weekends to hike through the countryside.<br />\nI can&rsquo;t recommend this enough; comfort is important when you&rsquo;re hiking for at least six hours a day.<br />\nThe mountain throws all sorts at you and blister-free feet are simply one less thing to worry about.</p>\n\n<p><strong>12 Don&rsquo;t over pack</strong></p>\n\n<p>I find it almost impossible to travel light. I have been notorious to go away for the weekend and pack a bag larger than myself.<br />\nI knew Kilimanjaro would be a challenge for me in this sense; I like to pack for every eventuality, and during the climb you experience both lush gentle rainforest and freezing snow.<br />\nWe were each limited to 15kg and when my bag was weighed, I hit this on the nose.<br />\nHowever, I quickly learnt I really didn&rsquo;t need so many clothes; it&rsquo;s cold, you&rsquo;re tired and you just don&rsquo;t have the energy to find through your bag for a clean outfit.<br />\nWhat&rsquo;s more, you&rsquo;re all in the same boat, and it&rsquo;s pretty refreshing to embrace mountain life fully without worrying about what you look like.<br />\n<strong>&nbsp;</strong></p>\n\n<p><strong>13 Don&rsquo;t forget your wet wipes&hellip;</strong></p>\n\n<p>When my bumper pack of oversize wet wipes arrived through the post a few weeks before the trek, my housemate laughed and said I couldn&rsquo;t possibly need that many.<br />\nShe was right, but they were also my most treasured item. When your only means of washing for the week is a small bowl of water provided tent-side most mornings, you&rsquo;ll thank your lucky stars you packed those wet wipes. It&rsquo;s amazing how much fresher I felt after a quick wet-wipe wash, and they come in handy when you find yourself using one of the not-so-luxurious mountain toilets too.</p>\n\n<p>Or your waterproofs<br />\nGranted, we did tackle the mountain during rainy season, but I didn&rsquo;t realize how important good waterproofs were until we were on the trek.<br />\nThe heavens actually opened when we set off on day one, so our gear was immediately put to the test.<br />\nLuckily, I had invested in waterproof trousers and gaiters, and a friend had lent me her excellent rain jacket, so I was nice and dry.<br />\nThe same can&rsquo;t be said for some other climbers we saw, and I&rsquo;m afraid the rumours are true &ndash; nothing dries on Kilimanjaro.<br />\nOne lesson I did learn the hard way is the need for waterproof trousers which fit over your boots.<br />\nSpeaking from experience, you really don&rsquo;t want to have to take your boots on and off in a downpour!<br />\n<strong>&nbsp;</strong></p>\n\n<p><strong>14 Porters are life savers</strong></p>\n\n<p>When we were told our group of 18 people would have 54 porters, we all stared at each other in shock.<br />\nSurely that many wouldn&rsquo;t be needed? But we were quickly to find out they were not just necessary; they were the difference between us reaching the summit or not.<br />\nWe boarded on our trek with G Adventures, and our team of G Fighters carried an endless list of items up the mountain for us, from tents and tables to cooking equipment and food. They were also invaluable on summit night.<br />\nI shall never forget James, who carried my day pack, constantly offered me water and held my hand when I began to slip at Stella Point. Had it not been for him, I&rsquo;m not sure I would have made it.<br />\n<strong>&nbsp;</strong></p>\n\n<p><strong>15 Be alert of altitude sickness</strong></p>\n\n<p>I thought about altitude sickness regularly before the trip. I read everything I could about it, I packed ginger tea and Diamox medication; I even considered altitude preparation at a centre in London.<br />\nAs it turns out, I quickly learnt all that there really isn&rsquo;t much you can do about altitude sickness when it attacks.<br />\nI unluckily felt sick from day two onward &ndash; I struggled to eat, and by summit night, I was fueled by only a bite or two of shortbread and half a jelly baby.<br />\nYet adrenaline somehow kicked in and the inspiring words of my fellow climbers kept me putting one foot in front of the other.<br />\nSome of my team mates suffered from sickness and exhaustion on summit day, but the porters know the danger signs to look out for and they continuously kept a watchful eye on us.<br />\nWe all made it, but altitude sickness is serious and can be fatal be alert of the symptoms and descend if you feel ill.</p>\n\n<p><strong>&nbsp;</strong></p>\n\n<p><strong>16 You have to climb down too!</strong></p>\n\n<p>It sounds bizarre, but I was so attentive on getting to the top that I hadn&rsquo;t given the descent a second thought.<br />\nWhen we were told we encountered a further three-hour trek back down to camp in a snow blizzard, my heart sank. I had used up everything in the tank to get to the summit, and I wasn&rsquo;t sure I had anything left.<br />\nAll I wanted to do was lie down and I kept slipping over. Three flips later and my porter was by my side, carrying my walking poles for me and aiding me over the slippery terrain.<br />\nWhen I finally reached my tent, he removed my boots, gave me a cup of tea and told me to rest.<br />\nI&rsquo;m not ashamed to say I then shed more tears; at the porter&rsquo;s kindness, from sheer exhaustion, and at the overwhelming realization that months of planning and training had finally paid off I would done it!.</p>",
    "button_name_1": null,
    "button_url_1": null,
    "button_name_2": null,
    "button_url_2": null,
    "package": [
      {
        "package_id": 299,
        "no_of_day": 5,
        "no_of_night": 4,
        "title": "Kilimanjaro Marangu Route climb.",
        "tour_group": "group",
        "image_url": "https://gallery.safari-trek-beach.com/images/gallery/tanzania/tour/MOUNT_KILIMANJARO_00900.JPG",
        "company_name": "Travel Africa Safari Agency",
        "tag": "seller",
        "operator_logo": "https://gallery.safari-trek-beach.com/images/user/35_1623660629.png",
        "start_city": "Arusha/Moshi",
        "end_city": "Arusha/Moshi",
        "adult_currency": 1750,
        "num_review": 87,
        "avg_review": 4.9,
        "level": [
          "budget"
        ],
        "destination": [
          "Marangu route",
          "Mount kilimanjaro"
        ]
      },
      {
        "package_id": 330,
        "no_of_day": 8,
        "no_of_night": 7,
        "title": "Private Lemosho Route Climb.",
        "tour_group": "private",
        "image_url": "https://gallery.safari-trek-beach.com/images/gallery/tanzania/tour/MOUNT_KILIMANJARO_30.jpg",
        "company_name": "Travel Africa Safari Agency",
        "tag": "seller",
        "operator_logo": "https://gallery.safari-trek-beach.com/images/user/35_1623660629.png",
        "start_city": "Arusha",
        "end_city": "Arusha",
        "adult_currency": 3100,
        "num_review": 87,
        "avg_review": 4.9,
        "level": [
          "budget",
          "camping"
        ],
        "destination": [
          "Arusha",
          "Lemosho route",
          "Mount kilimanjaro"
        ]
      },
      {
        "package_id": 354,
        "no_of_day": 9,
        "no_of_night": 8,
        "title": "Private Lemosho Route Climb (Crater Camp Night).",
        "tour_group": "private",
        "image_url": "https://gallery.safari-trek-beach.com/images/gallery/tanzania/tour/MOUNT_KILIMANJARO_001520.JPG",
        "company_name": "Travel Africa Safari Agency",
        "tag": "seller",
        "operator_logo": "https://gallery.safari-trek-beach.com/images/user/35_1623660629.png",
        "start_city": "Arusha or Moshi",
        "end_city": "Arusha or Moshi",
        "adult_currency": 3400,
        "num_review": 87,
        "avg_review": 4.9,
        "level": [
          "budget",
          "camping"
        ],
        "destination": [
          "Arusha",
          "Lemosho route",
          "Mount kilimanjaro"
        ]
      },
      {
        "package_id": 514,
        "no_of_day": 6,
        "no_of_night": 5,
        "title": "Kilimanjaro Premium Trek - Machame Route",
        "tour_group": "private",
        "image_url": "https://gallery.safari-trek-beach.com/images/gallery/tanzania/tour/MOUNT_KILIMANJARO_00310.JPG",
        "company_name": "Travel Africa Safari Agency",
        "tag": "seller",
        "operator_logo": "https://gallery.safari-trek-beach.com/images/user/35_1623660629.png",
        "start_city": "Arusha",
        "end_city": "Arusha",
        "adult_currency": 2500,
        "num_review": 87,
        "avg_review": 4.9,
        "level": [
          "camping",
          "luxury"
        ],
        "destination": [
          "Arusha",
          "Machame route",
          "Mount kilimanjaro"
        ]
      },
      {
        "package_id": 672,
        "no_of_day": 7,
        "no_of_night": 6,
        "title": "Private Rongai Route Climb.",
        "tour_group": "private",
        "image_url": "https://gallery.safari-trek-beach.com/images/gallery/tanzania/tour/MOUNT_KILIMANJARO_001660.JPG",
        "company_name": "Travel Africa Safari Agency",
        "tag": "seller",
        "operator_logo": "https://gallery.safari-trek-beach.com/images/user/35_1623660629.png",
        "start_city": "Arusha",
        "end_city": "Kilimanjaro Airport",
        "adult_currency": 2650,
        "num_review": 87,
        "avg_review": 4.9,
        "level": [
          "camping",
          "mid range"
        ],
        "destination": [
          "Arusha",
          "Mount kilimanjaro",
          "Rongai route"
        ]
      },
      {
        "package_id": 747,
        "no_of_day": 6,
        "no_of_night": 5,
        "title": "Shared Kilimanjaro Hike - Machame Route",
        "tour_group": "group",
        "image_url": "https://gallery.safari-trek-beach.com/images/gallery/tanzania/tour/MOUNT_KILIMANJARO_00520.JPG",
        "company_name": "Travel Africa Safari Agency",
        "tag": "seller",
        "operator_logo": "https://gallery.safari-trek-beach.com/images/user/35_1623660629.png",
        "start_city": "Arusha/Moshi",
        "end_city": "Arusha/Moshi",
        "adult_currency": 2100,
        "num_review": 87,
        "avg_review": 4.9,
        "level": [
          "budget",
          "camping"
        ],
        "destination": [
          "Machame route",
          "Mount kilimanjaro"
        ]
      },
      {
        "package_id": 1016,
        "no_of_day": 7,
        "no_of_night": 6,
        "title": "Mount Kilimanajro Climbing Via Machame Route.",
        "tour_group": "group",
        "image_url": "https://gallery.safari-trek-beach.com/images/gallery/tanzania/tour/MOUNT_KILIMANJARO_001320.jpg",
        "company_name": "Serengeti Safari Booking",
        "tag": "offer",
        "operator_logo": "https://gallery.safari-trek-beach.com/images/user/48_1623660658.png",
        "start_city": "Arusha/Moshi",
        "end_city": "Arusha/Moshi",
        "adult_currency": 2550,
        "num_review": 47,
        "avg_review": 5,
        "level": [
          "budget",
          "camping"
        ],
        "destination": [
          "Arusha",
          "Kilimanjaro Airport",
          "Machame route",
          "Marangu route",
          "Mount kilimanjaro"
        ]
      },
      {
        "package_id": 1025,
        "no_of_day": 5,
        "no_of_night": 4,
        "title": "Kilimanjaro Climb -Rongai Route",
        "tour_group": "private",
        "image_url": "https://gallery.safari-trek-beach.com/images/gallery/tanzania/tour/MOUNT_KILIMANJARO_0070.JPG",
        "company_name": "Serengeti Safari Booking",
        "tag": "offer",
        "operator_logo": "https://gallery.safari-trek-beach.com/images/user/48_1623660658.png",
        "start_city": "Arusha",
        "end_city": "Arusha",
        "adult_currency": 1750,
        "num_review": 47,
        "avg_review": 5,
        "level": [
          "budget",
          "camping"
        ],
        "destination": [
          "Mount kilimanjaro",
          "Rongai route"
        ]
      }
    ]
  }